import pandas as pd

data = {
                'name': ['Alice','Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Henry', 'Ivy', 'Jack'],
                'математика': [3, 5, 4, 3, 5, 4, 3, 5, 4, 3],
                'геометрия': [5, 4, 3, 5, 4, 3, 5, 4, 3, 5],
                'физика': [2, 4, 3, 5, 4, 3, 2, 4, 3, 5],
                'информатика': [4, 3, 5, 4, 3, 5, 4, 3, 5, 4],
                'история': [5, 5, 4, 3, 5, 4, 3, 5, 4, 3]
    }

df = pd.DataFrame(data)
print(df.head())
print(df.tail())
print(df.info())
print(df.describe())

print(f"Средняя оценка по математике - {df['математика'].mean()}")
print(f"Медианная оценка по математике - {df['математика'].median()}")
print(f"Стандартное отклонение по математике -{df['математика'].std()}")

print(f"Средняя оценка по геометрии - {df['геометрия'].mean()}")
print(f"Медианная оценка по геометрии - {df['геометрия'].median()}")
print(f"Стандартное отклонение по геометрии -{df['геометрия'].std()}")

print(f"Средняя оценка по физике - {df['физика'].mean()}")
print(f"Медианная оценка по физике - {df['физика'].median()}")
print(f"Стандартное отклонение по физике -{df['физика'].std()}")

print(f"Средняя оценка по информатике - {df['информатика'].mean()}")
print(f"Медианная оценка по информатике - {df['информатика'].median()}")
print(f"Стандартное отклонение по информатике -{df['информатика'].std()}")

print(f"Средняя оценка по истории - {df['история'].mean()}")
print(f"Медианная оценка по истории  - {df['история'].median()}")
print(f"Стандартное отклонение по истории  -{df['история'].std()}")

Q1_math = df['математика'].quantile(0.25)
Q3_math = df['математика'].quantile(0.75)
IQR = Q3_math - Q1_math
print(f"Границы интервала для математики Q1_math - {Q1_math},  Q3_math- {Q3_math}, IQR - {IQR}")
